Repository: IUseAll16Letters/gb_django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Please enter a valid age (10, 100)!
ru: Пожалуйста введите реальный возраст (10, 100)!

source: username
ru: имя пользователя

source: Required. 150 characters or fewer. ASCII letters and digits only.
ru: Обязательно. Менее 150 символов. Только символы ASCII и цифры

source: A user with that username already exists.
ru: Пользователь с таким ником уже существует

source: first name
ru: имя

source: last name
ru: фамилия

source: email address
ru: почтовый адрес

source: A user with that email address already exists.
ru: Пользователь с таким почтовым адресом уже существует

source: staff status
ru: статус сотрудника

source: Designates whether the user can log into this admin site.
ru: Определяет может ли пользователь логинится в админ панель

source: active
ru: активен

source: Designates whether this user should be treated as active. Unselect this instead of deleting accounts.
ru: Определяет следует ли расценивать пользователя как активного.Выберите этот пункт вместо удаления аккаунта

source: date joined
ru: присоединился

source: user
ru: пользователь

source: users
ru: пользователи

source: NewRegistration
ru: Регистрация

source: EditProfile
ru: Редактировать профиль

source: Register
ru: Регистрация

source: ProfileEdit
ru: Редактировать профиль

source: Login success!<br>Hi, %{username}
ru: Успешный вход!<br> Приве %{username}

source: See you later!
ru: Увидимся позже!

source: English
ru: Английский

source: Russian
ru: Русский

source: Delete lessons, {count}
ru: Удалить уроки, {count}

source: Unmark deleted, {count}
ru: Отметить как не удаленное, {count}

source: Mark as deleted
ru: Добавить отметку 'Удалено'

source: Remove deletion
ru: Убрать отметку 'Удалено'

source: Course
ru: Курс

source: Updated time at: {count}
ru: Обновлен в: {count}

source: Courses
ru: Курсы

source: Enter your message
ru: Введите сообщение

source: Message
ru: Сообщение

source: User
ru: Пользователь

source: No feedback
ru: Нет отзыва

source: Feedback
ru: Отзыв

source: Rating
ru: Рейтинг

source: Created
ru: Создан

source: CourseFeedback
ru: Отзыв к курсам

source: CourseFeedbacks
ru: Отзывы к курсам

source: Lesson
ru: Урок

source: Lessons
ru: Уроки

source: News
ru: Новости

source: Teacher
ru: Учитель

source: Teachers
ru: Учителя

source: Contacts
ru: Контакты

source: ContactUsPlease
ru: Контакты

source: PetroPavlFort
ru: Петропавловская крепость

source: SaintP
ru: Санкт-Петербург

source: Phone
ru: Телефон

source: PetroPavlFortAddr
ru: Территория Петропавловская крепость, 3Ж

source: KazanKremlin
ru: Казанский Кремль

source: Kazan
ru: Казань

source: KazanKremlAddr
ru: Территория Кремль, 11, Казань, Республика Татарстан, Россия

source: Moscow
ru: Москва

source: MoscowAddr
ru: Красная площадь, 7, Москва, Россия

source: ContactTechSUpportViaEm
ru: Отправить сообщение в техподдержку

source: Send
ru: Отправить

source: BeProactive
ru: Будь проактивен

source: StudyTrends
ru: Изучай только актуальные тренды современного IT

source: StudyAnywhere
ru: Учись где угодно

source: ParkLibraryWarmBlanket
ru: Парк, библиотека или дома под тёплым пледом - выбирай время и место учёбы сам

source: BraniacIsUs
ru: Braniac - это МЫ

source: JoinOurTeam
ru: Вливайся в нашу IT-тусовку - нас уже более 5000 брайниаков

source: GreetingsHeader
ru: Приветствую, путник!

source: GreetingMessage
ru: На данном портале мы собрали сообщество людей объединённых одной целью - получать знания! В современном мире уже сложно представить человека не общающегося с компьютером. Повсеместное проникновение интернета дало возможность объеденить людей и сделать знания доступными как никогда ранее. У тебя есть уникальная возможность получить актуальные знания используя современные технологии. Не упусти свой шанс и переходи на вкладку "Курсы", записывайся на курсы и становись востребованным специалистом.

source: MembersFeedback
ru: Отзывы участников сообщества

source: Lera
ru: Лера

source: LeraFeed
ru: Выучила Python и получаю 300кк в секунду! Спасибо Браниаку!

source: Anthony
ru: Антоша

source: AnthonyFeed
ru: Больше не туплю в excel - только БД только хардкор!

source: Leonard
ru: Леонард

source: LeonardFeed
ru: Как пропатчить KDE под FreeBSD?!

source: Venia
ru: Венниамин Петрович Шпак

source: VeniaFeed
ru: Как войти в айти после 130? Легко! Я тому - живой пример!

source: HundredsOfCourses
ru: Сотни готовых курсов от лучших авторов

source: HundredsOfCourseDesc
ru: Выбирай из огромной коллекции готовых решений для самообразования

source: TurnKnowledgeToGold
ru: Монетизируй знания

source: TurnKnowDesc
ru: Эксперт в свой области - давай к нам! Выгодные условия для тебя и пользователи со всего мира на нашей платформы

source: StrongUnited
ru: Вместе мы сила!

source: StrongUnitedDesc
ru: Проекты любой сложности становятся легче, если ты в компании единомышленников. Присоединяйся!

source: Filter
ru: Фильтровать

source: RegulationsTitle
ru: Правила и политика безопасности

source: RulesRegulationsHeading
ru: Правила и политика безопасности

source: MainRulesRegulationsText
ru: Данный ресурс является учебным проектом и не ставит целью сбор или обработку данных пользователей. Тем не менее, в связи с наличием в архитектуре проекта базы данных - при регистрации данные фиксируются и хранятся на сервере, расположенном на территории РФ и используются исключительно для идентификации пользователя на проекте. Пароли хранятся в зашифрованной форме, а сами данные могут быть удалены по запросу пользователя из формы обратной связи по адресу /mainapp/contacts/ в течение скольки-то там дней с момента обращения. Функционал проекта на 20 Января 23 не предполагает распространение персональных данных в какой-либо форме. В случае несогласия пользователя предоставить информацию - рекомендуется покинуть сайт или продолжить его использование без регистрации.

source: Message sent
ru: Сообщение отправлено

source: SendMessageTimeout
ru: Вы можете отправить сообщения не чаще чем 1 раз час

source: Django site admin
ru: Административный раздел

source: By %(filter_title)s
ru: По %(filter_title)s

source: HomePage
ru: Домашняя

source: Enter
ru: Войти

source: TermsConditions
ru: Положения и Условия

source: PrivacyCookies
ru: Конфиденциальность и Cookies

source: APIDocs
ru: Документация по API

source: Documentation
ru: Документация по сайту

source: WeAtSocials
ru: Мы в социальных сетях

source: OurApp
ru: Наше приложение

source: Profile
ru: Профиль

source: Edit profile
ru: Редактировать профиль

source: Moderation
ru: Модерация

source: Admin section
ru: Административный раздел

source: Logs
ru: Логи

source: Exit
ru: Выйти
