
from django.db import migrations


def forward_func(apps, schema_editor):
    Lessons = apps.get_model('mainapp', 'Lessons')
    lessons_data = (
        (1, 1, 'Lesson 1', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (1, 2, 'Lesson 2', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (1, 3, 'Lesson 3', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (1, 4, 'Lesson 4', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (1, 5, 'Lesson 5', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (1, 6, 'Lesson 6', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (1, 7, 'Lesson 7', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (1, 8, 'Lesson 8', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (2, 1, 'Lesson 1', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (2, 2, 'Lesson 2', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (2, 3, 'Lesson 3', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (2, 4, 'Lesson 4', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (2, 5, 'Lesson 5', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (2, 6, 'Lesson 6', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (2, 7, 'Lesson 7', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (2, 8, 'Lesson 8', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (3, 1, 'Lesson 1', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (3, 2, 'Lesson 2', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (3, 3, 'Lesson 3', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (3, 4, 'Lesson 4', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (3, 5, 'Lesson 5', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (3, 6, 'Lesson 6', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (3, 7, 'Lesson 7', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (3, 8, 'Lesson 8', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (4, 1, 'Lesson 1', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (4, 2, 'Lesson 2', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (4, 3, 'Lesson 3', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (4, 4, 'Lesson 4', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (4, 5, 'Lesson 5', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (4, 6, 'Lesson 6', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (4, 7, 'Lesson 7', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (4, 8, 'Lesson 8', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (5, 1, 'Lesson 1', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (5, 2, 'Lesson 2', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (5, 3, 'Lesson 3', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (5, 4, 'Lesson 4', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (5, 5, 'Lesson 5', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (5, 6, 'Lesson 6', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (5, 7, 'Lesson 7', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (5, 8, 'Lesson 8', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (6, 1, 'Lesson 1', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (6, 2, 'Lesson 2', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (6, 3, 'Lesson 3', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (6, 4, 'Lesson 4', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (6, 5, 'Lesson 5', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (6, 6, 'Lesson 6', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (6, 7, 'Lesson 7', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (6, 8, 'Lesson 8', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (7, 1, 'Lesson 1', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (7, 2, 'Lesson 2', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (7, 3, 'Lesson 3', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (7, 4, 'Lesson 4', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (7, 5, 'Lesson 5', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (7, 6, 'Lesson 6', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (7, 7, 'Lesson 7', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (7, 8, 'Lesson 8', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (8, 1, 'Lesson 1', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (8, 2, 'Lesson 2', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (8, 3, 'Lesson 3', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (8, 4, 'Lesson 4', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (8, 5, 'Lesson 5', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (8, 6, 'Lesson 6', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (8, 7, 'Lesson 7', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
        (8, 8, 'Lesson 8', 'Описание урока', False, '2021-07-11T12:53:26.832Z', '2021-07-11T12:53:26.833Z'),
    )
    Lessons.objects.bulk_create(
        [Lessons(
            id=idx,
            course_id=lesson[0],
            number=lesson[1],
            title=lesson[2],
            description=lesson[3],
            description_as_md=lesson[4],
        )
            for idx, lesson in enumerate(lessons_data, 1)]
    )


def reverse_func(apps, schema_editor):
    Lessons = apps.get_model('mainapp', 'Lessons')
    Lessons.objects.all().delete()


class Migration(migrations.Migration):
    dependencies = [
        ('mainapp', '0005_courses_data_migration')
    ]

    operations = [
        migrations.RunPython(forward_func, reverse_func)
    ]
